{
  "backend/main.mo": "Motoko actor defining three public shared functions: getGreeting (returns message from Greeting type), double (returns 2x input Nat), and concatenateMessage (concatenates message with sender, includes assertions for validation).",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features related to deployment error resolution and frontend import validation, listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing the ILF Home website structure including routing, pages (home, community, housing, support, volunteer), layout components, hooks, and styling with warm earth-tone color palette.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, neutral color palette using OKLCH color space for both light and dark modes, including sidebar, chart, and semantic color tokens.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'ILF Home Website', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component setting up TanStack Router with root layout (Header/Footer) and five routes (home, community, housing, support, volunteer), wrapped in QueryClientProvider.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with three-column grid layout displaying organization info, quick navigation links, contact details, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, desktop navigation menu, and mobile sheet menu using TanStack Router for navigation with active route highlighting and responsive design.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section with three contact info cards (phone, email, address) and a controlled form component that displays success toast on submission using the useToast hook.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with gradient background, headline, description, two CTA buttons (Get Help, Get Involved) using TanStack Router navigation, and hero image with responsive layout.",
  "frontend/src/hooks/use-toast.ts": "Implements a toast notification system with a custom hook and state management using listeners, supporting add/remove actions with auto-dismiss after 5 seconds and a limit of 1 toast.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook to manage backend actor instances with authentication, creating actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider for ICP, managing login/logout flow, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend API calls including useGetGreeting and useDouble, both dependent on authenticated actor availability.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a warm earth-toned color palette supporting both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/CommunityPage.tsx": "Displays community programs page with hero section, program cards (support groups, events, mentorship, workshops), and impact section highlighting the importance of social connections.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring hero section, about section describing ILF Home's mission, and service cards for housing, community, support, and volunteer programs with navigation.",
  "frontend/src/pages/HousingPage.tsx": "Housing services page displaying emergency shelter, transitional housing, permanent supportive housing, and housing navigation services with eligibility criteria and call-to-action.",
  "frontend/src/pages/SupportPage.tsx": "React page component displaying comprehensive support services (employment, education, case management, crisis intervention) and specialized programs for different populations (re-entry, aged-out teens, families, homeless) with hero section, service cards, and contact section.",
  "frontend/src/pages/VolunteerPage.tsx": "React page component for volunteer and donation opportunities, featuring ways to support (volunteer time, donations, goods, corporate partnerships), impact statistics, and a contact section with cards and icons.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter font, container settings, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting ILF Home website features, requirements, architectural notes about target audiences (homeless, low-income families, jail re-entry, aged-out teens), and deployment issue resolution status."
}