{
  "backend/main.mo": "Empty Motoko actor file serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting six completed requirements: updating phone number to 8133998071 and email to camillia@myptcs.com, and removing address fields from ContactSection and Footer components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the ILF Home website structure, including pages, components, routing, styling with warm earth tones, and updated contact information.",
  "frontend/index.css": "Global CSS with Tailwind directives and custom CSS variables defining a warm, neutral color system using OKLCH values for light and dark modes.",
  "frontend/index.html": "HTML entry point with basic meta tags, title 'ILF Home Website', and script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with five routes (home, community, housing, support, volunteer) wrapped in a Layout component containing Header and Footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying organization info, quick links, contact details (phone 8133998071, email camillia@myptcs.com, no address), and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, responsive navigation menu (desktop and mobile sheet), and active route highlighting using TanStack Router.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section with two contact cards (phone 8133998071 and email camillia@myptcs.com, no address) and a functional contact form with toast notifications.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with headline, description, two CTA buttons (Get Help, Get Involved), and hero image for the homepage.",
  "frontend/src/hooks/use-toast.ts": "Implements a toast notification system with a custom hook and global state management, supporting add/remove actions with auto-dismiss after 5 seconds and a limit of 1 toast.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout flow, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks that interact with the backend actor; currently contains only example structure and comments as no backend methods are implemented yet.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color palette for both light and dark modes, including primary terracotta, sage secondary, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication, rendering the main App component.",
  "frontend/src/pages/CommunityPage.tsx": "Displays community programs page with hero section and cards for support groups, events, mentorship, and life skills workshops, emphasizing connection and social support for homeless populations.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring hero section, about section describing ILF Home's mission, and service cards for housing, community, support, and volunteer programs with navigation to detail pages.",
  "frontend/src/pages/HousingPage.tsx": "Housing services page showcasing emergency shelter, transitional housing, permanent supportive housing, and navigation assistance with eligibility criteria for homeless individuals and families.",
  "frontend/src/pages/SupportPage.tsx": "React page component displaying comprehensive support services including employment, education, case management, and crisis intervention, with sections for different populations served (re-entry, aged-out teens, families, homeless) and a contact section.",
  "frontend/src/pages/VolunteerPage.tsx": "React page component showing volunteer and donation opportunities with impact statistics (500+ served, 85% housing stability, 200+ volunteers, 24/7 support) and ways to get involved including time, money, goods, and corporate partnerships.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system, container settings, custom animations (accordion), border radius variables, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state tracking file documenting completed contact information updates (phone to 8133998071, email to camillia@myptcs.com, address removal) across ContactSection and Footer components, with three pending feature requests for the same changes."
}